<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Fetches the latest Sassafras KeyClient Mac installer and imports into
Munki. Additionally, fetch the k2clientconfig tool from the Sassafras website
for the purposes of customizing the installer.

This recipe supports KeyClient 7.0 and up only. See SassafrasK2Client.download
for details on the REVISION Input variable, which you may wish to override.

K2CLIENTCONFIG_OPTIONS is a string that should be overridden with command-line
options to the 'k2clientconfig' tool. No sanity checking is performed beyond
what's done by k2clientconfig. The recipe includes one suggested default, more
documentation here:
http://www.sassafras.com/hrl/7.2/k2clientconfigM.html

There are k2clientconfig options to kill KeyAccess before installation, and to
start it after installation, implying we might not necessarily need a logout.
Some testing shows that when these options are used, the installation is still
not in a consistent state. Requiring a restart seems the only sane choice for now,
but it should be further investigated.

We use a separate installs item for KeyAccess.app, because the options passed
to k2clientconfig may alter which packages are installed, and therefore the
receipts array.

Sassafras uses two decimals in their mpkg versions (skipping the third) but
uses three decimals everywhere else (webpage, actual bundle files, preference
pane, etc.), so we use the three-decimal version.

The 7.2.0.3 installer has a known issue with version numbers in the pkg
components, but since we generate an installs item for KeyAccess.app already,
we use its version in the pkginfo.
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.sassafras-k2client</string>
    <key>Input</key>
    <dict>
        <key>K2CLIENTCONFIG_OPTIONS</key>
        <string>-s 2 -h keyserver.my.org -g yes -c yes -l yes</string>
        <key>NAME</key>
        <string>K2Client</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>support/K2Client</string>
        <key>MUNKI_CATEGORY</key>
        <string>System Management</string>
        <key>pkginfo</key>
        <dict>
            <key>RestartAction</key>
            <string>RequireRestart</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>This is the client for the Sassafras KeyServer licensing managing software.</string>
            <key>developer</key>
            <string>Sassafras Software, Inc.</string>
            <key>display_name</key>
            <string>KeyClient</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.sassafras-k2client</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/K2Client-Custom.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.sassafras.com/k2/revisions72/current/Installers/Macintosh%20Installers/Misc/k2clientconfig</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/k2clientconfig</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>base_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/K2Client-Custom.pkg</string>
                <key>k2clientconfig_options</key>
                <string>%K2CLIENTCONFIG_OPTIONS%</string>
                <key>k2clientconfig_path</key>
                <string>%RECIPE_CACHE_DIR%/k2clientconfig/k2clientconfig</string>
            </dict>
            <key>Processor</key>
            <string>SassafrasK2ClientCustomizer</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/InstallRoot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/K2Client-Custom.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/dist-unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/dist-unpack/KeyAccess.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/InstallRoot/Library</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/InstallRoot/Library/KeyAccess/KeyAccess.app/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/InstallRoot</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/KeyAccess/KeyAccess.app</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/K2Client-Custom.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
