<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Praat and imports into Munki.

There are two editions that can be downloaded: 32-bit or 64-bit, which
can be overridden by setting ARCH_EDITION to either '32' or '64'.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.munki.Praat</string>
	<key>Input</key>
	<dict>
		<key>ARCH_EDITION</key>
		<string>32</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Speech</string>
		<key>NAME</key>
		<string>Praat</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Praat is a program for speech analysis and synthesis.</string>
			<key>developer</key>
			<string>The Praat Project</string>
			<key>display_name</key>
			<string>Praat</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.Praat</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%destination_path%</string>
			</dict>
			<key>Processor</key>
			<string>PraatVersionFixer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
