<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest OmniOutlinerPro disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.omnioutlinerpro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OmniOutlinerPro</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>MUNKI_CATEGORY</key>
        <string>Productivity</string>
        <key>APPCAST_URL</key>
        <string>http://update.omnigroup.com/appcast/com.omnigroup.OmniOutlinerPro3</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Welcome to OmniOutliner 3, an amazingly flexible program for creating, collecting, and organizing information. Use OmniOutliner's document structure to brainstorm new ideas, drill out specifics, and line up the steps needed to get everything done. It's more than just an outlining tool—you've got multiple columns, smart checkboxes, customizable popup lists, and an über-innovative styles system at your disposal. Use OmniOutliner to draft to-do lists, create agendas, manage tasks, track expenses, take notes, plan events, write screenplays . . . and just about anything else you can think of. </string>
            <key>developer</key>
            <string>The Omni Group</string>
            <key>display_name</key>
            <string>OmniOutliner Professional</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%APPCAST_URL%</string>
                <key>alternate_xmlns_url</key>
                <string>http://www.omnigroup.com/namespace/omniappcast/v1</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
